# YOLOv8.0n backbone with CBAM
nc: 62  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, CBAM, [64]]         # 1-CBAM attention
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [-1, 1, CBAM, [128]]        # 3-CBAM attention
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P3/8
  - [-1, 1, CBAM, [256]]        # 6-CBAM attention
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 8-P4/16
  - [-1, 1, CBAM, [512]]        # 9-CBAM attention
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 11-P5/32
  - [-1, 1, CBAM, [1024]]       # 12-CBAM attention
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]    # 14

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 17
  - [-1, 1, CBAM, [512]]       # CBAM in head

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 20
  - [-1, 1, CBAM, [256]]       # CBAM in head

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]        # 23
  - [-1, 1, CBAM, [512]]       # CBAM in head

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]]       # 26
  - [-1, 1, CBAM, [1024]]      # CBAM in head

  - [[20, 23, 26], 1, Detect, [nc]]  # Detect(P3, P4, P5)